{
  "original": {
    "title": "CIPP Standards | By CyberDrain",
    "headerText": null,
    "heroTitle": "CyberDrain Standards",
    "heroSubtitle": "Comprehensive standards and best practices for Microsoft 365 and Azure environments.",
    "heroClasses": null,
    "allButtons": [
      "High Impact21",
      "Low Impact90",
      "Medium Impact48",
      "All Categories159",
      "Defender Standards12",
      "Device Management Standards2",
      "Entra (AAD) Standards37",
      "Exchange Standards42",
      "Global Standards16",
      "Intune Standards11",
      "SharePoint Standards20",
      "Teams Standards12",
      "Templates7",
      "Show New Only",
      "Tags",
      "Recommended By",
      "Show Deprecated"
    ],
    "impactButtons": [
      "High Impact21",
      "Low Impact90",
      "Medium Impact48"
    ],
    "categoryButtons": [
      "All Categories159",
      "Defender Standards12",
      "Device Management Standards2",
      "Entra (AAD) Standards37",
      "Exchange Standards42",
      "Global Standards16",
      "Intune Standards11",
      "SharePoint Standards20",
      "Teams Standards12"
    ],
    "standardCardCount": 0,
    "cardTitles": [
      "New Standards",
      "Set Intune Windows diagnostic data settings",
      "Set auto enable archive mailbox state",
      "Configure MDM enrollment when adding work or school account",
      "Configure Auto-Archiving Threshold"
    ],
    "firstCardBody": null,
    "dashboardClasses": "grid grid-cols-1 md:grid-cols-12 gap-4 mb-8",
    "impactCard": null,
    "categoryCard": null,
    "filteredCard": null,
    "filterBar": {
      "containerClasses": "w-full md:flex-auto relative group",
      "parentClasses": "flex flex-wrap items-center gap-3",
      "hasSearchOnOwnRow": false
    },
    "themeToggle": null,
    "headerBrand": null,
    "bodyClasses": "",
    "htmlClasses": "",
    "bodyBg": "rgba(0, 0, 0, 0) none repeat scroll 0% 0% / auto padding-box border-box",
    "dashboardNegMargin": [
      "text-xs text-orange-500 block -mt-1",
      "max-w-7xl mx-auto px-4 sm:px-6 lg:px-8 -mt-12 w-full"
    ],
    "expandedCard": {
      "boldElementsCount": 0,
      "boldTexts": []
    }
  },
  "local": {
    "title": "Your Brand - M365 Standards",
    "headerText": "Your Brandby Your Company",
    "heroTitle": "Your Brand Standards",
    "heroSubtitle": "Comprehensive standards and best practices for Microsoft 365 and Azure environments.",
    "heroClasses": "pt-8 pb-24 text-center sm:pt-12",
    "allButtons": [
      "High Impact21",
      "Low Impact91",
      "Medium Impact47",
      "All Categories159",
      "Defender12",
      "Device Managemen...2",
      "Entra (AAD)37",
      "Exchange43",
      "Global16",
      "Intune11",
      "SharePoint19",
      "Teams12",
      "Templates7",
      "Show New Only",
      "Tags",
      "Recommended By",
      "Show Deprecated",
      "Set Intune Windows diagnostic data settingsLow ImpactSome features require Windows E3 or equivalent licenses Configures Windows diagnostic data settings for Intune. Enables features like Windows update reports, device readiness reports, and driver update reports. More information can be found in Microsoft's documentation.1/27/2026",
      "Set auto enable archive mailbox stateLow ImpactEnables or disables the tenant policy that automatically provisions an archive mailbox when a user's primary mailbox reaches 90% of its quota.1/16/2026",
      "Configure MDM enrollment when adding work or school accountMedium ImpactControls the \"Allow my organization to manage my device\" prompt when adding a work or school account on Windows. This setting determines whether automatic MDM enrollment occurs during account registration.12/15/2025",
      "Configure Auto-Archiving ThresholdLow ImpactConfigures the auto-archiving threshold percentage for the tenant. When a mailbox exceeds this threshold, the oldest items are automatically moved to the archive mailbox. Archive must be enabled manually or via the CIPP standard 'Enable Online Archive for all users'. More information can be found in Microsoft's documentation.12/11/2025",
      "Update Secure Score Control ProfilesLow ImpactAllows bulk updating of Secure Score control profiles across tenants. Select controls and assign them to different states: Default, Ignored, Third-Party, or Reviewed.11/19/2025",
      "Set Teams chat with anyone settingLow ImpactControls whether users can start Teams chats with any email address, inviting external recipients as guests via email.11/3/2025",
      "Control BitLocker key recovery for owned devicesLow ImpactControls whether standard users can recover BitLocker keys for devices they own.10/12/2025",
      "Assignment Filter TemplateMedium ImpactDeploy and manage assignment filter templates.10/4/2025",
      "Set Teams Chat Protection SettingsLow ImpactConfigures Teams chat protection settings including weaponizable file protection and malicious URL protection.10/2/2025",
      "Windows Hello for Business enrollment configurationLow ImpactSets the Windows Hello for Business configuration during device enrollment.9/25/2025",
      "Deploy Check Chrome ExtensionLow ImpactDeploys the Check Chrome extension via Intune OMA-URI custom policies for both Chrome and Edge browsers with configurable settings. Chrome ID: benimdeioplgkhanklclahllklceahbe, Edge ID: knepjpocdagponkonnbggpcnhnaikajg9/18/2025",
      "Remove legacy Outlook Report add-insLow ImpactRemoves legacy Report Phishing and Report Message Outlook add-ins.8/26/2025",
      "Restrict Email Attachments on Unmanaged DevicesMedium ImpactRestricts how users on unmanaged devices can interact with email attachments in Outlook on the web and new Outlook for Windows. Prevents downloading attachments or blocks viewing them entirely.8/22/2025",
      "Set SharePoint and OneDrive File RequestsMedium ImpactEnables or disables File Requests for SharePoint and OneDrive, allowing users to create secure upload-only links. Optionally sets the maximum number of days for the link to remain active before expiring.7/30/2025",
      "Complete Authentication Methods Policy MigrationMedium ImpactCompletes the migration of authentication methods policy to the new format7/7/2025",
      "Set Entra ID Custom Banned Password ListMedium ImpactRequires Entra ID P1. Updates and enables the Entra ID custom banned password list with the supplied words. Enter words separated by commas or semicolons. Each word must be 4-16 characters long. Maximum 1,000 words allowed.6/28/2025",
      "Disable Exchange Online PowerShell for non-admin usersMedium ImpactDisables Exchange Online PowerShell access for non-admin users by setting the RemotePowerShellEnabled property to false for each user. This helps prevent attackers from using PowerShell to run malicious commands, access file systems, registry, and distribute ransomware throughout networks. Users with admin roles are automatically excluded.6/19/2025",
      "Enables DMARC on MOERA (onmicrosoft.com) domainsLow ImpactNote: requires 'Domain Name Administrator' GDAP role. This should be enabled even if the MOERA (onmicrosoft.com) domains is not used for sending. Enabling this prevents email spoofing. The default value is 'v=DMARC1; p=reject;' recommended because the domain is only used within M365 and reporting is not needed. Omitting pct tag default to 100%6/16/2025",
      "Teams Meeting Verification (CAPTCHA)Low ImpactConfigures CAPTCHA verification for external users joining Teams meetings. This helps prevent unauthorized AI notetakers and bots from joining meetings.6/14/2025",
      "Set two-click confirmation for encrypted emails in New OutlookLow ImpactConfigures the two-click confirmation requirement for viewing encrypted/protected emails in OWA and new Outlook. When enabled, users must click \"View message\" before accessing protected content, providing an additional layer of privacy protection.6/13/2025",
      "Set Default Sharing Link SettingsLow ImpactConfigure the SharePoint default sharing link type and permission. This setting controls both the type of sharing link created by default and the permission level assigned to those links.6/13/2025",
      "Restrict access to SharePoint and OneDrive from unmanaged devicesHigh ImpactEntra P1 required. Block or limit access to SharePoint and OneDrive content from unmanaged devices (those not hybrid AD joined or compliant in Intune). These controls rely on Microsoft Entra Conditional Access policies and can take up to 24 hours to take effect.6/13/2025",
      "Restrict third-party storage services in Microsoft 365 on the webMedium ImpactRestricts third-party storage services in Microsoft 365 on the web by managing the Microsoft 365 on the web service principal. This disables integrations with services like Dropbox, Google Drive, Box, and other third-party storage providers.6/6/2025",
      "Enable Name PronunciationLow ImpactEnables the Name Pronunciation feature for the tenant. This allows users to set their name pronunciation in their profile.6/6/2025",
      "Enable internal phishing protection for FormsLow ImpactEnables internal phishing protection for Microsoft Forms to help prevent malicious forms from being created and shared within the organization. This feature scans forms created by internal users for potential phishing content and suspicious patterns.6/6/2025",
      "Allow guest users in TeamsLow ImpactAllow guest users access to teams.6/3/2025",
      "Disable Unlicensed Resource Mailbox Entra accountsMedium ImpactBlocks login for all accounts that are marked as a resource mailbox and does not have a license assigned. Accounts that are synced from on-premises AD are excluded, as account state is managed in the on-premises AD.6/1/2025",
      "Deploy Mail Contact TemplateLow ImpactCreates new mail contacts in Exchange Online across all selected tenants based on the selected templates. The contact will be visible in the Global Address List unless hidden.5/31/2025",
      "Set Direct Send stateMedium ImpactSets the state of Direct Send in Exchange Online. Direct Send allows applications to send emails directly to Exchange Online mailboxes as the tenants domains, without requiring authentication.5/28/2025",
      "Set Mailbox Recipient LimitsLow ImpactSets the maximum number of recipients that can be specified in the To, Cc, and Bcc fields of a message for all mailboxes in the tenant.5/28/2025",
      "Custom Quarantine PolicyLow ImpactThis standard creates a Custom Quarantine Policies that can be used in Anti-Spam and all MDO365 policies. Quarantine Policies can be used to specify recipients permissions, enable end-user spam notifications, and specify the release action preference5/16/2025",
      "Set Exchange Outbound Spam LimitsLow ImpactConfigures the outbound spam recipient limits (external per hour, internal per hour, per day) and the action to take when a limit is reached. The 'Set Outbound Spam Alert e-mail' standard is recommended to configure together with this one. 5/13/2025",
      "SafeLinks Policy TemplateMedium ImpactDeploy and manage SafeLinks policy templates to protect against malicious URLs in emails and Office documents.4/29/2025",
      "Set Teams Meeting Recording ExpirationMedium ImpactSets the default number of days after which Teams meeting recordings automatically expire. Valid values are -1 (Never Expire) or between 1 and 99999. The default value is 120 days.4/17/2025",
      "SharePoint Mass Deletion AlertLow ImpactSets a e-mail address to alert when a User deletes more than 20 SharePoint files within 60 minutes. NB: Requires a Office 365 E5 subscription, Office 365 E3 with Threat Intelligence or Office 365 EquivioAnalytics add-on.4/7/2025",
      "Device enrollment restrictionsLow ImpactSets the default platform restrictions for enrolling devices into Intune. Note: Do not block personally owned if platform is blocked.4/1/2025",
      "Add allowed domains to Spoof IntelligenceMedium ImpactThis adds allowed domains to the Spoof Intelligence Allow/Block List.3/28/2025",
      "Phishing Simulation ConfigurationMedium ImpactThis creates a phishing simulation policy that enables phishing simulations for the entire tenant.3/27/2025",
      "Preferred language for all usersHigh ImpactSets the preferred language property for all users in the tenant. This will override the user's language settings.2/26/2025",
      "Configure MDM user scopeLow ImpactConfigures the MDM user scope. This also sets the terms of use, discovery and compliance URL to default URLs.2/18/2025",
      "Set Anti-Spam Connection Filter Safe ListMedium ImpactSets the anti-spam connection filter policy option 'safe list' in Defender.2/15/2025",
      "Configure Authentication Methods Policy SettingsLow ImpactConfigures the report suspicious activity settings and system credential preferences in the authentication methods policy.2/10/2025",
      "Automatically deploy proxy addressesMedium ImpactAutomatically adds all available domains as a proxy address.2/7/2025",
      "Retention Policy, permanently delete items in Deleted Items after X daysHigh ImpactCreates a CIPP - Deleted Items retention policy tag that permanently deletes items in the Deleted Items folder after X days.2/2/2025",
      "Allow users to set profile photosLow ImpactControls whether users can set their own profile photos in Microsoft 365.1/19/2025",
      "Cleanup stale Entra devicesHigh ImpactRemediate is currently not available. Cleans up Entra devices that have not connected/signed in for the specified number of days.1/19/2025",
      "Global Messaging Policy for Microsoft TeamsMedium ImpactSets the properties of the Global messaging policy.1/10/2025",
      "Guest Invite settingMedium ImpactThis setting controls who can invite guests to your directory to collaborate on resources secured by your company, such as SharePoint sites or Azure resources.11/12/2024",
      "Set Intune Compliance SettingsLow ImpactSets the mark devices with no compliance policy assigned as compliance/non compliant and Compliance status validity period.11/12/2024",
      "Define Global Meeting Policy for TeamsLow ImpactDefines the CIS recommended global meeting policy for Teams. This includes AllowAnonymousUsersToJoinMeeting, AllowAnonymousUsersToStartMeeting, AutoAdmittedUsers, AllowPSTNUsersToBypassLobby, MeetingChatEnabledType, DesignatedPresenterRoleMode, AllowExternalParticipantGiveRequestControl11/12/2024",
      "Default voice and face enrollmentLow ImpactControls whether users with this policy can set the voice profile capture and enrollment through the Recognition tab in their Teams client settings.11/12/2024",
      "Federation Configuration for Microsoft TeamsMedium ImpactSets the properties of the Global federation configuration.7/31/2024",
      "Disallow emails to be sent to channel email addressesLow ImpactShould users be allowed to send emails directly to a channel email addresses?7/30/2024",
      "External Access Settings for Microsoft TeamsMedium ImpactSets the properties of the Global external access policy.7/30/2024",
      "Define approved cloud storage services for external file sharing in TeamsLow ImpactEnsure external file sharing in Teams is enabled for only approved cloud storage services.7/28/2024",
      "Disable automatic forwarding to external recipientsHigh ImpactDisables the ability for users to automatically forward e-mails to external recipients.7/26/2024",
      "Set SharePoint sync button stateMedium ImpactIf disabled, users in the tenant will no longer be able to use the Sync button to sync SharePoint content on all sites. However, existing synced content will remain functional on the user's computer.7/26/2024",
      "Quarantine Release Request AlertLow ImpactSets a e-mail address to alert when a User requests to release a quarantined message.7/15/2024",
      "Default Spam Filter PolicyMedium ImpactThis standard creates a Spam filter policy similar to the default strict policy.7/15/2024",
      "Disable Legacy WorkflowsLow ImpactDisables the creation of new SharePoint 2010 and 2013 classic workflows and removes the 'Return to classic SharePoint' link on modern SharePoint list and library pages.7/15/2024",
      "Enable SharePoint and OneDrive integration with Azure AD B2BLow ImpactEnsure SharePoint and OneDrive integration with Azure AD B2B is enabled7/9/2024",
      "Disallow downloading infected files from SharePointLow ImpactEnsure Office 365 SharePoint infected files are disallowed for download7/9/2024",
      "Set guest access to expire automaticallyMedium ImpactEnsure guest access to a site or OneDrive will expire automatically7/9/2024",
      "Require re-authentication with verification codeMedium ImpactEnsure re-authentication with verification code is restricted7/9/2024",
      "Deploy ApplicationLow ImpactDeploys selected applications to the tenant. Use a comma separated list of application IDs to deploy multiple applications. Permissions will be copied from the source application.7/7/2024",
      "Set the state of the built-in Report button in OutlookMedium ImpactSet the state of the spam submission button in Outlook6/28/2024",
      "Enable Litigation Hold for all usersLow ImpactEnables litigation hold for all UserMailboxes with a valid license.6/25/2024",
      "Set Intune Company Portal branding profileLow ImpactSets the branding profile for the Intune Company Portal app. This is a tenant wide setting and overrules any settings set on the app level.6/20/2024",
      "Restrict sharing to a specific domainHigh ImpactRestricts sharing to only users with the specified domain. This is useful for organizations that only want to share with their own domain.6/20/2024",
      "Enables per user MFA for all users.High ImpactEnables per user MFA for all users.6/14/2024",
      "Enable PronounsLow ImpactEnables the Pronouns feature for the tenant. This allows users to set their pronouns in their profile.6/5/2024",
      "Set Cloud Message Recall stateLow ImpactSets the Cloud Message Recall state for the tenant. This allows users to recall messages from the cloud.5/31/2024",
      "Set Teams Meetings by default stateLow ImpactSets the default state for automatically turning meetings into Teams meetings for the tenant. This can be overridden by the user in Outlook.5/31/2024",
      "Set Bookings stateMedium ImpactSets the state of Bookings on the tenant. Bookings is a scheduling tool that allows users to book appointments with others both internal and external.5/31/2024",
      "Set shorten meetings stateMedium ImpactSets the shorten meetings settings on a tenant level. This will shorten meetings by the selected amount of minutes. Valid values are 0 to 29. Short meetings are under 60 minutes, long meetings are over 60 minutes.5/27/2024",
      "Set branding for the tenantLow ImpactSets the branding for the tenant. This includes the login page, and the Office 365 portal.5/13/2024",
      "Set Global Quarantine Notification IntervalLow ImpactSets the Global Quarantine Notification Interval to the selected value. Determines how often the quarantine notification is sent to users.5/3/2024",
      "Disable TNEF/winmail.datLow ImpactDisables Transport Neutral Encapsulation Format (TNEF)/winmail.dat for the tenant. TNEF can cause issues if the recipient is not using a client supporting TNEF.4/26/2024",
      "Set Focused Inbox stateLow ImpactSets the default Focused Inbox state for the tenant. This can be overridden by the user.4/26/2024",
      "Set Default Timezone for TenantLow ImpactSets the default timezone for the tenant. This will be used for all new users and sites.4/20/2024",
      "Sets the Cross-tenant access setting to trust external MFALow ImpactSets the state of the Cross-tenant access setting to trust external MFA. This allows guest users to use their home tenant MFA to access your tenant.3/26/2024",
      "Default Safe Links PolicyLow ImpactThis creates a Safe Links policy that automatically scans, tracks, and and enables safe links for Email, Office, and Teams for both external and internal senders3/25/2024",
      "Default Anti-Phishing PolicyLow ImpactThis creates a Anti-Phishing policy that automatically enables Mailbox Intelligence and spoofing, optional switches for Mail tips.3/25/2024",
      "Default Safe Attachment PolicyLow ImpactThis creates a Safe Attachment policy3/25/2024",
      "Default Atp Policy For O365Low ImpactThis creates a Atp policy that enables Defender for Office 365 for SharePoint, OneDrive and Microsoft Teams.3/25/2024",
      "Default Malware Filter PolicyLow ImpactThis creates a Malware filter policy that enables the default File filter and Zero-hour auto purge for malware.3/25/2024",
      "Disable App creation by usersLow ImpactDisables the ability for users to create App registrations in the tenant.3/20/2024",
      "Deploy Mail ContactLow ImpactCreates a new mail contact in Exchange Online across all selected tenants. The contact will be visible in the Global Address List.3/19/2024",
      "Lower Transport Message Expiration to 12 hoursLow ImpactSets the transport message configuration to timeout a message at 12 hours.2/23/2024",
      "Disables QR Code Pin as an MFA methodHigh ImpactThis blocks users from using QR Code Pin as an MFA method. If a user only has QR Code Pin as a MFA method, they will be unable to log in.2/10/2024",
      "Disable users from installing add-ins in OutlookMedium ImpactDisables the ability for users to install add-ins in Outlook. This is to prevent users from installing malicious add-ins.2/5/2024",
      "Disable legacy basic authentication for SharePointMedium ImpactDisables the ability to authenticate with SharePoint using legacy authentication methods. Any applications that use legacy authentication will need to be updated to use modern authentication.2/5/2024",
      "Enable Phishing Protection system via branding CSSLow ImpactAdds branding to the logon page that only appears if the url is not login.microsoftonline.com. This potentially prevents AITM attacks via EvilNginx. This will also automatically generate alerts if a clone of your login page has been found when set to Remediate.1/22/2024",
      "Enable Online Archive for all usersLow ImpactEnables the In-Place Online Archive for all UserMailboxes with a valid license.1/20/2024",
      "Disable additional storage providers in OWALow ImpactDisables the ability for users to open files in Outlook on the Web, from other providers such as Box, Dropbox, Facebook, Google Drive, OneDrive Personal, etc.1/17/2024",
      "Enable all MailTipsLow ImpactEnables all MailTips in Outlook. MailTips are the notifications Outlook and Outlook on the web shows when an email you create, meets some requirements1/14/2024",
      "Enable Customer LockboxLow ImpactEnables Customer Lockbox that offers an approval process for Microsoft support to access organization data1/8/2024",
      "Enable Mailbox auditingLow ImpactEnables Mailbox auditing for all mailboxes and on tenant level. Disables audit bypass on all mailboxes. Unified Audit Log needs to be enabled for this standard to function.1/8/2024",
      "Disable external calendar sharingLow ImpactDisables the ability for users to share their calendar with external users. Only for the default policy, so exclusions can be made if needed.1/8/2024",
      "Enable Autopilot Status PageLow ImpactDeploy the Autopilot Status Page, which shows progress during device setup through Autopilot.12/30/2023",
      "Enable Autopilot ProfileLow ImpactAssign the appropriate Autopilot profile to streamline device deployment.12/30/2023",
      "Intune TemplateHigh ImpactDeploy and manage Intune templates across devices.12/30/2023",
      "Transport Rule TemplateMedium ImpactDeploy transport rules to manage email flow.12/30/2023",
      "Conditional Access TemplateHigh ImpactManage conditional access policies for better security.12/30/2023",
      "Exchange Connector TemplateMedium ImpactDeploy and manage Exchange connectors.12/30/2023",
      "Group TemplateMedium ImpactDeploy and manage group templates.12/30/2023",
      "Enable Hardware OAuth tokensLow ImpactEnables the HardwareOath authenticationMethod for the tenant. This allows you to use hardware tokens for generating 6 digit MFA codes.12/18/2023",
      "Disables SMS as an MFA methodHigh ImpactThis blocks users from using SMS as an MFA method. If a user only has SMS as a MFA method, they will be unable to log in.12/18/2023",
      "Disables Voice call as an MFA methodHigh ImpactThis blocks users from using Voice call as an MFA method. If a user only has Voice as a MFA method, they will be unable to log in.12/18/2023",
      "Disables Email as an MFA methodHigh ImpactThis blocks users from using email as an MFA method. This disables the email OTP option for guest users, and instead prompts them to create a Microsoft account.12/18/2023",
      "Disables Certificates as an MFA methodHigh ImpactThis blocks users from using Certificates as an MFA method.12/18/2023",
      "Enable OTP via AuthenticatorLow ImpactAllows you to use MS authenticator OTP token generator12/6/2023",
      "Enable App consent admin requestsLow ImpactEnables App consent admin requests for the tenant via the GA role. Does not overwrite existing reviewer settings11/27/2023",
      "Set send/receive size limitsLow ImpactSets the Send and Receive limits for new users. Valid values are 1MB to 150MB11/16/2023",
      "Remove Safe Senders to prevent SPF bypassMedium ImpactLoops through all users and removes the Safe Senders list. This is to prevent SPF bypass attacks, as the Safe Senders list is not checked by SPF.10/26/2023",
      "Require Multi-factor Authentication to register or join devices with Microsoft EntraMedium ImpactRequires MFA for all users to register devices with Intune. This is useful when not using Conditional Access.10/23/2023",
      "Set Add Shortcuts To OneDrive button stateMedium ImpactIf disabled, the button Add shortcut to OneDrive will be removed and users in the tenant will no longer be able to add new shortcuts to their OneDrive. Existing shortcuts will remain functional7/25/2023",
      "Set inactive device retirement daysLow ImpactA value between 31 and 365 is supported. retired devices are removed from Intune after the specified number of days.5/19/2023",
      "Set Authenticator Lite stateLow ImpactSets the state of Authenticator Lite, Authenticator lite is a companion app for passwordless authentication.5/18/2023",
      "Set Outbound Spam Alert e-mailLow ImpactSet the Outbound Spam Alert e-mail address5/3/2023",
      "Set Sharing Level for Default calendarLow ImpactSets the default sharing level for the default calendar, for all users4/27/2023",
      "Enable LAPS on the tenantLow ImpactEnables the tenant to use LAPS. You must still create a policy for LAPS to be active on all devices. Use the template standards to deploy this by default.4/25/2023",
      "Set Maximum Number of Devices per userMedium ImpactSets the maximum number of devices that can be registered by a user. A value of 0 disables device registration by users3/27/2023",
      "Rotate DKIM keys that are 1024 bit to 2048 bitLow ImpactRotate DKIM keys that are 1024 bit to 2048 bit3/14/2023",
      "Enables DKIM for all domains that currently support itLow ImpactEnables DKIM for all domains that currently support it3/14/2023",
      "Enable OTP Software OAuth tokensLow ImpactAllows you to use any software OAuth token generator12/18/2022",
      "Enable FIDO2 capabilitiesLow ImpactEnables the FIDO2 authenticationMethod for the tenant12/8/2022",
      "Sets the state for the request to setup AuthenticatorLow ImpactSets the state of the registration campaign for the tenant12/8/2022",
      "Disable M365 Tenant creation by usersLow ImpactRestricts creation of M365 tenants to the Global Administrator or Tenant Creator roles.11/29/2022",
      "Disable Guest accounts that have not logged on for a number of daysMedium ImpactBlocks login for guest users that have not logged in for a number of days10/20/2022",
      "Allow users to consent to applications with low security risk (Prevent OAuth phishing. Lower impact, less secure)Medium ImpactSets the default oauth consent level so users can consent to applications that have low risks.8/16/2022",
      "Disable M365 Group creation by usersLow ImpactRestricts M365 group creation to certain admin roles. This disables the ability to create Teams, SharePoint sites, Planner, etc7/17/2022",
      "Disable Security Group creation by usersMedium ImpactCompletely disables the creation of security groups by users. This also breaks the ability to manage groups themselves, or create Teams7/17/2022",
      "Set deleted user retention time in OneDriveLow ImpactSets the retention period for deleted users OneDrive to the specified period of time. The default is 30 days.6/15/2022",
      "Set Sharing Level for OneDrive and SharePointHigh ImpactSets the default sharing level for OneDrive and SharePoint. This is a tenant wide setting and overrules any settings set on the site level6/15/2022",
      "Disable Re-sharing by External UsersHigh ImpactDisables the ability for external users to share files they don't own. Sharing links can only be made for People with existing access6/15/2022",
      "Disable site creation by standard usersHigh ImpactDisables users from creating new SharePoint sites6/15/2022",
      "Exclude File Extensions from SyncingHigh ImpactSets the file extensions that are excluded from syncing with OneDrive. These files will be blocked from upload. '*.' is automatically added to the extension and can be omitted.6/15/2022",
      "Do not allow Mac devices to sync using OneDriveHigh ImpactDisables the ability for Mac devices to sync with OneDrive.6/15/2022",
      "Disable daily Insight/Viva reportsLow ImpactDisables the daily viva reports for all users. This standard requires the CIPP-SAM application to have the Company Administrator (Global Admin) role in the tenant. Enable this using CIPP > Advanced > Super Admin > SAM App Roles. Activate the roles with a CPV refresh.5/25/2022",
      "Allow users to send from their alias addressesMedium ImpactEnables the ability for users to send from their alias addresses.5/25/2022",
      "Restrict guest user access to directory objectsLow ImpactDisables Guest access to enumerate directory objects. This prevents guest users from seeing other users or guests in the directory.5/4/2022",
      "Enable Activity based TimeoutMedium ImpactEnables and sets Idle session timeout for Microsoft 365 to 1 hour. This policy affects most M365 web apps4/13/2022",
      "Enable Temporary Access PasswordsLow ImpactEnables TAP and sets the default TAP lifetime to 1 hour. This configuration also allows you to select if a TAP is single use or multi-logon.3/15/2022",
      "Set contact e-mailsLow ImpactDefines the email address to receive general updates and information related to M365 subscriptions. Leave a contact field blank if you do not want to update the contact information.3/13/2022",
      "Undo App Consent StandardHigh ImpactDisables App consent and set to Allow user consent for apps1/7/2022",
      "Enable Security DefaultsHigh ImpactEnables security defaults for the tenant, for newer tenants this is enabled by default. Do not enable this feature if you use Conditional Access.11/19/2021",
      "Enable the Unified Audit LogLow ImpactEnables the Unified Audit Log for tracking and auditing activities. Also runs Enable-OrganizationCustomization if necessary.11/16/2021",
      "Enable Usernames instead of pseudo anonymised names in reportsLow ImpactShows usernames instead of pseudo anonymised names in reports. This standard is required for reporting to work correctly.11/16/2021",
      "Disable SMTP Basic AuthenticationMedium ImpactDisables SMTP AUTH organization-wide, impacting POP and IMAP clients that rely on SMTP for sending emails. Default for new tenants. For more information, see the Microsoft documentation11/16/2021",
      "Enable Passwordless with Location information and Number MatchingLow ImpactEnables the MS authenticator app to display information about the app that is requesting authentication. This displays the application name.11/16/2021",
      "Do not expire passwordsLow ImpactDisables the expiration of passwords for the tenant by setting the password expiration policy to never expire for any user.11/16/2021",
      "Remove Legacy MFA if SD or CA is activeMedium ImpactThis standard currently does not function and can be safely disabled11/16/2021",
      "Disable Self Service LicensingMedium ImpactNote: requires 'Billing Administrator' GDAP role. This standard disables all self service licenses and enables all exclusions11/16/2021",
      "Require admin consent for applications (Prevent OAuth phishing)Medium ImpactDisables users from being able to consent to applications, except for those specified in the field below11/16/2021",
      "Enable Auto-expanding archivesLow ImpactEnables auto-expanding archives for the tenant11/16/2021",
      "Enable or disable 'external' warning in OutlookLow ImpactAdds or removes indicators to e-mail messages received from external senders in Outlook. Works on all Outlook clients/OWA11/16/2021",
      "Set mailbox Sent Items delegation (Sent items for shared mailboxes)Medium ImpactSets emails sent as and on behalf of shared mailboxes to also be stored in the shared mailbox sent items folder11/16/2021",
      "Disable Shared Mailbox Entra accountsMedium ImpactBlocks login for all accounts that are marked as a shared mailbox. This is Microsoft best practice to prevent direct logons to shared mailboxes.11/16/2021"
    ],
    "impactButtons": [
      "High Impact21",
      "Low Impact91",
      "Medium Impact47",
      "Set Intune Windows diagnostic data settingsLow ImpactSome features require Windows E3 or equivalent licenses Configures Windows diagnostic data settings for Intune. Enables features like Windows update reports, device readiness reports, and driver update reports. More information can be found in Microsoft's documentation.1/27/2026",
      "Set auto enable archive mailbox stateLow ImpactEnables or disables the tenant policy that automatically provisions an archive mailbox when a user's primary mailbox reaches 90% of its quota.1/16/2026",
      "Configure MDM enrollment when adding work or school accountMedium ImpactControls the \"Allow my organization to manage my device\" prompt when adding a work or school account on Windows. This setting determines whether automatic MDM enrollment occurs during account registration.12/15/2025",
      "Configure Auto-Archiving ThresholdLow ImpactConfigures the auto-archiving threshold percentage for the tenant. When a mailbox exceeds this threshold, the oldest items are automatically moved to the archive mailbox. Archive must be enabled manually or via the CIPP standard 'Enable Online Archive for all users'. More information can be found in Microsoft's documentation.12/11/2025",
      "Update Secure Score Control ProfilesLow ImpactAllows bulk updating of Secure Score control profiles across tenants. Select controls and assign them to different states: Default, Ignored, Third-Party, or Reviewed.11/19/2025",
      "Set Teams chat with anyone settingLow ImpactControls whether users can start Teams chats with any email address, inviting external recipients as guests via email.11/3/2025",
      "Control BitLocker key recovery for owned devicesLow ImpactControls whether standard users can recover BitLocker keys for devices they own.10/12/2025",
      "Assignment Filter TemplateMedium ImpactDeploy and manage assignment filter templates.10/4/2025",
      "Set Teams Chat Protection SettingsLow ImpactConfigures Teams chat protection settings including weaponizable file protection and malicious URL protection.10/2/2025",
      "Windows Hello for Business enrollment configurationLow ImpactSets the Windows Hello for Business configuration during device enrollment.9/25/2025",
      "Deploy Check Chrome ExtensionLow ImpactDeploys the Check Chrome extension via Intune OMA-URI custom policies for both Chrome and Edge browsers with configurable settings. Chrome ID: benimdeioplgkhanklclahllklceahbe, Edge ID: knepjpocdagponkonnbggpcnhnaikajg9/18/2025",
      "Remove legacy Outlook Report add-insLow ImpactRemoves legacy Report Phishing and Report Message Outlook add-ins.8/26/2025",
      "Restrict Email Attachments on Unmanaged DevicesMedium ImpactRestricts how users on unmanaged devices can interact with email attachments in Outlook on the web and new Outlook for Windows. Prevents downloading attachments or blocks viewing them entirely.8/22/2025",
      "Set SharePoint and OneDrive File RequestsMedium ImpactEnables or disables File Requests for SharePoint and OneDrive, allowing users to create secure upload-only links. Optionally sets the maximum number of days for the link to remain active before expiring.7/30/2025",
      "Complete Authentication Methods Policy MigrationMedium ImpactCompletes the migration of authentication methods policy to the new format7/7/2025",
      "Set Entra ID Custom Banned Password ListMedium ImpactRequires Entra ID P1. Updates and enables the Entra ID custom banned password list with the supplied words. Enter words separated by commas or semicolons. Each word must be 4-16 characters long. Maximum 1,000 words allowed.6/28/2025",
      "Disable Exchange Online PowerShell for non-admin usersMedium ImpactDisables Exchange Online PowerShell access for non-admin users by setting the RemotePowerShellEnabled property to false for each user. This helps prevent attackers from using PowerShell to run malicious commands, access file systems, registry, and distribute ransomware throughout networks. Users with admin roles are automatically excluded.6/19/2025",
      "Enables DMARC on MOERA (onmicrosoft.com) domainsLow ImpactNote: requires 'Domain Name Administrator' GDAP role. This should be enabled even if the MOERA (onmicrosoft.com) domains is not used for sending. Enabling this prevents email spoofing. The default value is 'v=DMARC1; p=reject;' recommended because the domain is only used within M365 and reporting is not needed. Omitting pct tag default to 100%6/16/2025",
      "Teams Meeting Verification (CAPTCHA)Low ImpactConfigures CAPTCHA verification for external users joining Teams meetings. This helps prevent unauthorized AI notetakers and bots from joining meetings.6/14/2025",
      "Set two-click confirmation for encrypted emails in New OutlookLow ImpactConfigures the two-click confirmation requirement for viewing encrypted/protected emails in OWA and new Outlook. When enabled, users must click \"View message\" before accessing protected content, providing an additional layer of privacy protection.6/13/2025",
      "Set Default Sharing Link SettingsLow ImpactConfigure the SharePoint default sharing link type and permission. This setting controls both the type of sharing link created by default and the permission level assigned to those links.6/13/2025",
      "Restrict access to SharePoint and OneDrive from unmanaged devicesHigh ImpactEntra P1 required. Block or limit access to SharePoint and OneDrive content from unmanaged devices (those not hybrid AD joined or compliant in Intune). These controls rely on Microsoft Entra Conditional Access policies and can take up to 24 hours to take effect.6/13/2025",
      "Restrict third-party storage services in Microsoft 365 on the webMedium ImpactRestricts third-party storage services in Microsoft 365 on the web by managing the Microsoft 365 on the web service principal. This disables integrations with services like Dropbox, Google Drive, Box, and other third-party storage providers.6/6/2025",
      "Enable Name PronunciationLow ImpactEnables the Name Pronunciation feature for the tenant. This allows users to set their name pronunciation in their profile.6/6/2025",
      "Enable internal phishing protection for FormsLow ImpactEnables internal phishing protection for Microsoft Forms to help prevent malicious forms from being created and shared within the organization. This feature scans forms created by internal users for potential phishing content and suspicious patterns.6/6/2025",
      "Allow guest users in TeamsLow ImpactAllow guest users access to teams.6/3/2025",
      "Disable Unlicensed Resource Mailbox Entra accountsMedium ImpactBlocks login for all accounts that are marked as a resource mailbox and does not have a license assigned. Accounts that are synced from on-premises AD are excluded, as account state is managed in the on-premises AD.6/1/2025",
      "Deploy Mail Contact TemplateLow ImpactCreates new mail contacts in Exchange Online across all selected tenants based on the selected templates. The contact will be visible in the Global Address List unless hidden.5/31/2025",
      "Set Direct Send stateMedium ImpactSets the state of Direct Send in Exchange Online. Direct Send allows applications to send emails directly to Exchange Online mailboxes as the tenants domains, without requiring authentication.5/28/2025",
      "Set Mailbox Recipient LimitsLow ImpactSets the maximum number of recipients that can be specified in the To, Cc, and Bcc fields of a message for all mailboxes in the tenant.5/28/2025",
      "Custom Quarantine PolicyLow ImpactThis standard creates a Custom Quarantine Policies that can be used in Anti-Spam and all MDO365 policies. Quarantine Policies can be used to specify recipients permissions, enable end-user spam notifications, and specify the release action preference5/16/2025",
      "Set Exchange Outbound Spam LimitsLow ImpactConfigures the outbound spam recipient limits (external per hour, internal per hour, per day) and the action to take when a limit is reached. The 'Set Outbound Spam Alert e-mail' standard is recommended to configure together with this one. 5/13/2025",
      "SafeLinks Policy TemplateMedium ImpactDeploy and manage SafeLinks policy templates to protect against malicious URLs in emails and Office documents.4/29/2025",
      "Set Teams Meeting Recording ExpirationMedium ImpactSets the default number of days after which Teams meeting recordings automatically expire. Valid values are -1 (Never Expire) or between 1 and 99999. The default value is 120 days.4/17/2025",
      "SharePoint Mass Deletion AlertLow ImpactSets a e-mail address to alert when a User deletes more than 20 SharePoint files within 60 minutes. NB: Requires a Office 365 E5 subscription, Office 365 E3 with Threat Intelligence or Office 365 EquivioAnalytics add-on.4/7/2025",
      "Device enrollment restrictionsLow ImpactSets the default platform restrictions for enrolling devices into Intune. Note: Do not block personally owned if platform is blocked.4/1/2025",
      "Add allowed domains to Spoof IntelligenceMedium ImpactThis adds allowed domains to the Spoof Intelligence Allow/Block List.3/28/2025",
      "Phishing Simulation ConfigurationMedium ImpactThis creates a phishing simulation policy that enables phishing simulations for the entire tenant.3/27/2025",
      "Preferred language for all usersHigh ImpactSets the preferred language property for all users in the tenant. This will override the user's language settings.2/26/2025",
      "Configure MDM user scopeLow ImpactConfigures the MDM user scope. This also sets the terms of use, discovery and compliance URL to default URLs.2/18/2025",
      "Set Anti-Spam Connection Filter Safe ListMedium ImpactSets the anti-spam connection filter policy option 'safe list' in Defender.2/15/2025",
      "Configure Authentication Methods Policy SettingsLow ImpactConfigures the report suspicious activity settings and system credential preferences in the authentication methods policy.2/10/2025",
      "Automatically deploy proxy addressesMedium ImpactAutomatically adds all available domains as a proxy address.2/7/2025",
      "Retention Policy, permanently delete items in Deleted Items after X daysHigh ImpactCreates a CIPP - Deleted Items retention policy tag that permanently deletes items in the Deleted Items folder after X days.2/2/2025",
      "Allow users to set profile photosLow ImpactControls whether users can set their own profile photos in Microsoft 365.1/19/2025",
      "Cleanup stale Entra devicesHigh ImpactRemediate is currently not available. Cleans up Entra devices that have not connected/signed in for the specified number of days.1/19/2025",
      "Global Messaging Policy for Microsoft TeamsMedium ImpactSets the properties of the Global messaging policy.1/10/2025",
      "Guest Invite settingMedium ImpactThis setting controls who can invite guests to your directory to collaborate on resources secured by your company, such as SharePoint sites or Azure resources.11/12/2024",
      "Set Intune Compliance SettingsLow ImpactSets the mark devices with no compliance policy assigned as compliance/non compliant and Compliance status validity period.11/12/2024",
      "Define Global Meeting Policy for TeamsLow ImpactDefines the CIS recommended global meeting policy for Teams. This includes AllowAnonymousUsersToJoinMeeting, AllowAnonymousUsersToStartMeeting, AutoAdmittedUsers, AllowPSTNUsersToBypassLobby, MeetingChatEnabledType, DesignatedPresenterRoleMode, AllowExternalParticipantGiveRequestControl11/12/2024",
      "Default voice and face enrollmentLow ImpactControls whether users with this policy can set the voice profile capture and enrollment through the Recognition tab in their Teams client settings.11/12/2024",
      "Federation Configuration for Microsoft TeamsMedium ImpactSets the properties of the Global federation configuration.7/31/2024",
      "Disallow emails to be sent to channel email addressesLow ImpactShould users be allowed to send emails directly to a channel email addresses?7/30/2024",
      "External Access Settings for Microsoft TeamsMedium ImpactSets the properties of the Global external access policy.7/30/2024",
      "Define approved cloud storage services for external file sharing in TeamsLow ImpactEnsure external file sharing in Teams is enabled for only approved cloud storage services.7/28/2024",
      "Disable automatic forwarding to external recipientsHigh ImpactDisables the ability for users to automatically forward e-mails to external recipients.7/26/2024",
      "Set SharePoint sync button stateMedium ImpactIf disabled, users in the tenant will no longer be able to use the Sync button to sync SharePoint content on all sites. However, existing synced content will remain functional on the user's computer.7/26/2024",
      "Quarantine Release Request AlertLow ImpactSets a e-mail address to alert when a User requests to release a quarantined message.7/15/2024",
      "Default Spam Filter PolicyMedium ImpactThis standard creates a Spam filter policy similar to the default strict policy.7/15/2024",
      "Disable Legacy WorkflowsLow ImpactDisables the creation of new SharePoint 2010 and 2013 classic workflows and removes the 'Return to classic SharePoint' link on modern SharePoint list and library pages.7/15/2024",
      "Enable SharePoint and OneDrive integration with Azure AD B2BLow ImpactEnsure SharePoint and OneDrive integration with Azure AD B2B is enabled7/9/2024",
      "Disallow downloading infected files from SharePointLow ImpactEnsure Office 365 SharePoint infected files are disallowed for download7/9/2024",
      "Set guest access to expire automaticallyMedium ImpactEnsure guest access to a site or OneDrive will expire automatically7/9/2024",
      "Require re-authentication with verification codeMedium ImpactEnsure re-authentication with verification code is restricted7/9/2024",
      "Deploy ApplicationLow ImpactDeploys selected applications to the tenant. Use a comma separated list of application IDs to deploy multiple applications. Permissions will be copied from the source application.7/7/2024",
      "Set the state of the built-in Report button in OutlookMedium ImpactSet the state of the spam submission button in Outlook6/28/2024",
      "Enable Litigation Hold for all usersLow ImpactEnables litigation hold for all UserMailboxes with a valid license.6/25/2024",
      "Set Intune Company Portal branding profileLow ImpactSets the branding profile for the Intune Company Portal app. This is a tenant wide setting and overrules any settings set on the app level.6/20/2024",
      "Restrict sharing to a specific domainHigh ImpactRestricts sharing to only users with the specified domain. This is useful for organizations that only want to share with their own domain.6/20/2024",
      "Enables per user MFA for all users.High ImpactEnables per user MFA for all users.6/14/2024",
      "Enable PronounsLow ImpactEnables the Pronouns feature for the tenant. This allows users to set their pronouns in their profile.6/5/2024",
      "Set Cloud Message Recall stateLow ImpactSets the Cloud Message Recall state for the tenant. This allows users to recall messages from the cloud.5/31/2024",
      "Set Teams Meetings by default stateLow ImpactSets the default state for automatically turning meetings into Teams meetings for the tenant. This can be overridden by the user in Outlook.5/31/2024",
      "Set Bookings stateMedium ImpactSets the state of Bookings on the tenant. Bookings is a scheduling tool that allows users to book appointments with others both internal and external.5/31/2024",
      "Set shorten meetings stateMedium ImpactSets the shorten meetings settings on a tenant level. This will shorten meetings by the selected amount of minutes. Valid values are 0 to 29. Short meetings are under 60 minutes, long meetings are over 60 minutes.5/27/2024",
      "Set branding for the tenantLow ImpactSets the branding for the tenant. This includes the login page, and the Office 365 portal.5/13/2024",
      "Set Global Quarantine Notification IntervalLow ImpactSets the Global Quarantine Notification Interval to the selected value. Determines how often the quarantine notification is sent to users.5/3/2024",
      "Disable TNEF/winmail.datLow ImpactDisables Transport Neutral Encapsulation Format (TNEF)/winmail.dat for the tenant. TNEF can cause issues if the recipient is not using a client supporting TNEF.4/26/2024",
      "Set Focused Inbox stateLow ImpactSets the default Focused Inbox state for the tenant. This can be overridden by the user.4/26/2024",
      "Set Default Timezone for TenantLow ImpactSets the default timezone for the tenant. This will be used for all new users and sites.4/20/2024",
      "Sets the Cross-tenant access setting to trust external MFALow ImpactSets the state of the Cross-tenant access setting to trust external MFA. This allows guest users to use their home tenant MFA to access your tenant.3/26/2024",
      "Default Safe Links PolicyLow ImpactThis creates a Safe Links policy that automatically scans, tracks, and and enables safe links for Email, Office, and Teams for both external and internal senders3/25/2024",
      "Default Anti-Phishing PolicyLow ImpactThis creates a Anti-Phishing policy that automatically enables Mailbox Intelligence and spoofing, optional switches for Mail tips.3/25/2024",
      "Default Safe Attachment PolicyLow ImpactThis creates a Safe Attachment policy3/25/2024",
      "Default Atp Policy For O365Low ImpactThis creates a Atp policy that enables Defender for Office 365 for SharePoint, OneDrive and Microsoft Teams.3/25/2024",
      "Default Malware Filter PolicyLow ImpactThis creates a Malware filter policy that enables the default File filter and Zero-hour auto purge for malware.3/25/2024",
      "Disable App creation by usersLow ImpactDisables the ability for users to create App registrations in the tenant.3/20/2024",
      "Deploy Mail ContactLow ImpactCreates a new mail contact in Exchange Online across all selected tenants. The contact will be visible in the Global Address List.3/19/2024",
      "Lower Transport Message Expiration to 12 hoursLow ImpactSets the transport message configuration to timeout a message at 12 hours.2/23/2024",
      "Disables QR Code Pin as an MFA methodHigh ImpactThis blocks users from using QR Code Pin as an MFA method. If a user only has QR Code Pin as a MFA method, they will be unable to log in.2/10/2024",
      "Disable users from installing add-ins in OutlookMedium ImpactDisables the ability for users to install add-ins in Outlook. This is to prevent users from installing malicious add-ins.2/5/2024",
      "Disable legacy basic authentication for SharePointMedium ImpactDisables the ability to authenticate with SharePoint using legacy authentication methods. Any applications that use legacy authentication will need to be updated to use modern authentication.2/5/2024",
      "Enable Phishing Protection system via branding CSSLow ImpactAdds branding to the logon page that only appears if the url is not login.microsoftonline.com. This potentially prevents AITM attacks via EvilNginx. This will also automatically generate alerts if a clone of your login page has been found when set to Remediate.1/22/2024",
      "Enable Online Archive for all usersLow ImpactEnables the In-Place Online Archive for all UserMailboxes with a valid license.1/20/2024",
      "Disable additional storage providers in OWALow ImpactDisables the ability for users to open files in Outlook on the Web, from other providers such as Box, Dropbox, Facebook, Google Drive, OneDrive Personal, etc.1/17/2024",
      "Enable all MailTipsLow ImpactEnables all MailTips in Outlook. MailTips are the notifications Outlook and Outlook on the web shows when an email you create, meets some requirements1/14/2024",
      "Enable Customer LockboxLow ImpactEnables Customer Lockbox that offers an approval process for Microsoft support to access organization data1/8/2024",
      "Enable Mailbox auditingLow ImpactEnables Mailbox auditing for all mailboxes and on tenant level. Disables audit bypass on all mailboxes. Unified Audit Log needs to be enabled for this standard to function.1/8/2024",
      "Disable external calendar sharingLow ImpactDisables the ability for users to share their calendar with external users. Only for the default policy, so exclusions can be made if needed.1/8/2024",
      "Enable Autopilot Status PageLow ImpactDeploy the Autopilot Status Page, which shows progress during device setup through Autopilot.12/30/2023",
      "Enable Autopilot ProfileLow ImpactAssign the appropriate Autopilot profile to streamline device deployment.12/30/2023",
      "Intune TemplateHigh ImpactDeploy and manage Intune templates across devices.12/30/2023",
      "Transport Rule TemplateMedium ImpactDeploy transport rules to manage email flow.12/30/2023",
      "Conditional Access TemplateHigh ImpactManage conditional access policies for better security.12/30/2023",
      "Exchange Connector TemplateMedium ImpactDeploy and manage Exchange connectors.12/30/2023",
      "Group TemplateMedium ImpactDeploy and manage group templates.12/30/2023",
      "Enable Hardware OAuth tokensLow ImpactEnables the HardwareOath authenticationMethod for the tenant. This allows you to use hardware tokens for generating 6 digit MFA codes.12/18/2023",
      "Disables SMS as an MFA methodHigh ImpactThis blocks users from using SMS as an MFA method. If a user only has SMS as a MFA method, they will be unable to log in.12/18/2023",
      "Disables Voice call as an MFA methodHigh ImpactThis blocks users from using Voice call as an MFA method. If a user only has Voice as a MFA method, they will be unable to log in.12/18/2023",
      "Disables Email as an MFA methodHigh ImpactThis blocks users from using email as an MFA method. This disables the email OTP option for guest users, and instead prompts them to create a Microsoft account.12/18/2023",
      "Disables Certificates as an MFA methodHigh ImpactThis blocks users from using Certificates as an MFA method.12/18/2023",
      "Enable OTP via AuthenticatorLow ImpactAllows you to use MS authenticator OTP token generator12/6/2023",
      "Enable App consent admin requestsLow ImpactEnables App consent admin requests for the tenant via the GA role. Does not overwrite existing reviewer settings11/27/2023",
      "Set send/receive size limitsLow ImpactSets the Send and Receive limits for new users. Valid values are 1MB to 150MB11/16/2023",
      "Remove Safe Senders to prevent SPF bypassMedium ImpactLoops through all users and removes the Safe Senders list. This is to prevent SPF bypass attacks, as the Safe Senders list is not checked by SPF.10/26/2023",
      "Require Multi-factor Authentication to register or join devices with Microsoft EntraMedium ImpactRequires MFA for all users to register devices with Intune. This is useful when not using Conditional Access.10/23/2023",
      "Set Add Shortcuts To OneDrive button stateMedium ImpactIf disabled, the button Add shortcut to OneDrive will be removed and users in the tenant will no longer be able to add new shortcuts to their OneDrive. Existing shortcuts will remain functional7/25/2023",
      "Set inactive device retirement daysLow ImpactA value between 31 and 365 is supported. retired devices are removed from Intune after the specified number of days.5/19/2023",
      "Set Authenticator Lite stateLow ImpactSets the state of Authenticator Lite, Authenticator lite is a companion app for passwordless authentication.5/18/2023",
      "Set Outbound Spam Alert e-mailLow ImpactSet the Outbound Spam Alert e-mail address5/3/2023",
      "Set Sharing Level for Default calendarLow ImpactSets the default sharing level for the default calendar, for all users4/27/2023",
      "Enable LAPS on the tenantLow ImpactEnables the tenant to use LAPS. You must still create a policy for LAPS to be active on all devices. Use the template standards to deploy this by default.4/25/2023",
      "Set Maximum Number of Devices per userMedium ImpactSets the maximum number of devices that can be registered by a user. A value of 0 disables device registration by users3/27/2023",
      "Rotate DKIM keys that are 1024 bit to 2048 bitLow ImpactRotate DKIM keys that are 1024 bit to 2048 bit3/14/2023",
      "Enables DKIM for all domains that currently support itLow ImpactEnables DKIM for all domains that currently support it3/14/2023",
      "Enable OTP Software OAuth tokensLow ImpactAllows you to use any software OAuth token generator12/18/2022",
      "Enable FIDO2 capabilitiesLow ImpactEnables the FIDO2 authenticationMethod for the tenant12/8/2022",
      "Sets the state for the request to setup AuthenticatorLow ImpactSets the state of the registration campaign for the tenant12/8/2022",
      "Disable M365 Tenant creation by usersLow ImpactRestricts creation of M365 tenants to the Global Administrator or Tenant Creator roles.11/29/2022",
      "Disable Guest accounts that have not logged on for a number of daysMedium ImpactBlocks login for guest users that have not logged in for a number of days10/20/2022",
      "Allow users to consent to applications with low security risk (Prevent OAuth phishing. Lower impact, less secure)Medium ImpactSets the default oauth consent level so users can consent to applications that have low risks.8/16/2022",
      "Disable M365 Group creation by usersLow ImpactRestricts M365 group creation to certain admin roles. This disables the ability to create Teams, SharePoint sites, Planner, etc7/17/2022",
      "Disable Security Group creation by usersMedium ImpactCompletely disables the creation of security groups by users. This also breaks the ability to manage groups themselves, or create Teams7/17/2022",
      "Set deleted user retention time in OneDriveLow ImpactSets the retention period for deleted users OneDrive to the specified period of time. The default is 30 days.6/15/2022",
      "Set Sharing Level for OneDrive and SharePointHigh ImpactSets the default sharing level for OneDrive and SharePoint. This is a tenant wide setting and overrules any settings set on the site level6/15/2022",
      "Disable Re-sharing by External UsersHigh ImpactDisables the ability for external users to share files they don't own. Sharing links can only be made for People with existing access6/15/2022",
      "Disable site creation by standard usersHigh ImpactDisables users from creating new SharePoint sites6/15/2022",
      "Exclude File Extensions from SyncingHigh ImpactSets the file extensions that are excluded from syncing with OneDrive. These files will be blocked from upload. '*.' is automatically added to the extension and can be omitted.6/15/2022",
      "Do not allow Mac devices to sync using OneDriveHigh ImpactDisables the ability for Mac devices to sync with OneDrive.6/15/2022",
      "Disable daily Insight/Viva reportsLow ImpactDisables the daily viva reports for all users. This standard requires the CIPP-SAM application to have the Company Administrator (Global Admin) role in the tenant. Enable this using CIPP > Advanced > Super Admin > SAM App Roles. Activate the roles with a CPV refresh.5/25/2022",
      "Allow users to send from their alias addressesMedium ImpactEnables the ability for users to send from their alias addresses.5/25/2022",
      "Restrict guest user access to directory objectsLow ImpactDisables Guest access to enumerate directory objects. This prevents guest users from seeing other users or guests in the directory.5/4/2022",
      "Enable Activity based TimeoutMedium ImpactEnables and sets Idle session timeout for Microsoft 365 to 1 hour. This policy affects most M365 web apps4/13/2022",
      "Enable Temporary Access PasswordsLow ImpactEnables TAP and sets the default TAP lifetime to 1 hour. This configuration also allows you to select if a TAP is single use or multi-logon.3/15/2022",
      "Set contact e-mailsLow ImpactDefines the email address to receive general updates and information related to M365 subscriptions. Leave a contact field blank if you do not want to update the contact information.3/13/2022",
      "Undo App Consent StandardHigh ImpactDisables App consent and set to Allow user consent for apps1/7/2022",
      "Enable Security DefaultsHigh ImpactEnables security defaults for the tenant, for newer tenants this is enabled by default. Do not enable this feature if you use Conditional Access.11/19/2021",
      "Enable the Unified Audit LogLow ImpactEnables the Unified Audit Log for tracking and auditing activities. Also runs Enable-OrganizationCustomization if necessary.11/16/2021",
      "Enable Usernames instead of pseudo anonymised names in reportsLow ImpactShows usernames instead of pseudo anonymised names in reports. This standard is required for reporting to work correctly.11/16/2021",
      "Disable SMTP Basic AuthenticationMedium ImpactDisables SMTP AUTH organization-wide, impacting POP and IMAP clients that rely on SMTP for sending emails. Default for new tenants. For more information, see the Microsoft documentation11/16/2021",
      "Enable Passwordless with Location information and Number MatchingLow ImpactEnables the MS authenticator app to display information about the app that is requesting authentication. This displays the application name.11/16/2021",
      "Do not expire passwordsLow ImpactDisables the expiration of passwords for the tenant by setting the password expiration policy to never expire for any user.11/16/2021",
      "Remove Legacy MFA if SD or CA is activeMedium ImpactThis standard currently does not function and can be safely disabled11/16/2021",
      "Disable Self Service LicensingMedium ImpactNote: requires 'Billing Administrator' GDAP role. This standard disables all self service licenses and enables all exclusions11/16/2021",
      "Require admin consent for applications (Prevent OAuth phishing)Medium ImpactDisables users from being able to consent to applications, except for those specified in the field below11/16/2021",
      "Enable Auto-expanding archivesLow ImpactEnables auto-expanding archives for the tenant11/16/2021",
      "Enable or disable 'external' warning in OutlookLow ImpactAdds or removes indicators to e-mail messages received from external senders in Outlook. Works on all Outlook clients/OWA11/16/2021",
      "Set mailbox Sent Items delegation (Sent items for shared mailboxes)Medium ImpactSets emails sent as and on behalf of shared mailboxes to also be stored in the shared mailbox sent items folder11/16/2021",
      "Disable Shared Mailbox Entra accountsMedium ImpactBlocks login for all accounts that are marked as a shared mailbox. This is Microsoft best practice to prevent direct logons to shared mailboxes.11/16/2021"
    ],
    "categoryButtons": [
      "All Categories159"
    ],
    "standardCardCount": 162,
    "cardTitles": [
      "Set Intune Windows diagnostic data settings",
      "Set auto enable archive mailbox state",
      "Configure MDM enrollment when adding work or school account",
      "Configure Auto-Archiving Threshold",
      "Update Secure Score Control Profiles"
    ],
    "firstCardBody": {
      "text": "Some features require Windows E3 or equivalent licenses Configures Windows diagnostic data settings for Intune. Enables features like Windows update reports, device readiness reports, and driver updat",
      "hasBoldElement": true,
      "boldText": "Some features require Windows E3 or equivalent licenses"
    },
    "dashboardClasses": "grid gap-4 sm:grid-cols-2 lg:grid-cols-3",
    "impactCard": {
      "rowCount": 3,
      "rows": [
        {
          "text": "High Impact21",
          "classes": "flex w-full items-center justify-between rounded-lg border px-3 py-2 text-sm transition-all hover:scale-[1.02] border-border hover:bg-surface-secondary",
          "hasBorder": true
        },
        {
          "text": "Low Impact91",
          "classes": "flex w-full items-center justify-between rounded-lg border px-3 py-2 text-sm transition-all hover:scale-[1.02] border-border hover:bg-surface-secondary",
          "hasBorder": true
        },
        {
          "text": "Medium Impact47",
          "classes": "flex w-full items-center justify-between rounded-lg border px-3 py-2 text-sm transition-all hover:scale-[1.02] border-border hover:bg-surface-secondary",
          "hasBorder": true
        }
      ]
    },
    "categoryCard": {
      "layout": "mb-1 flex items-center gap-2",
      "isGrid": false,
      "buttonCount": 10,
      "buttons": [
        {
          "text": "All Categories159",
          "classes": "flex items-center justify-between rounded-lg border p-3 text-xs font-medium transition-all hover:scale-[1.02] border-brand-primary/30 bg-brand-primary-light"
        },
        {
          "text": "Defender12",
          "classes": "flex items-center justify-between rounded-lg border p-3 text-xs font-medium transition-all hover:scale-[1.02] border-border bg-surface hover:bg-surface-secondary"
        },
        {
          "text": "Device Managemen...2",
          "classes": "flex items-center justify-between rounded-lg border p-3 text-xs font-medium transition-all hover:scale-[1.02] border-border bg-surface hover:bg-surface-secondary"
        }
      ]
    },
    "filteredCard": {
      "mainCount": "159",
      "newSectionLayout": "border-t border-border pt-3",
      "newSectionText": "New StandardsAdded in last 30 days11% of filteredShow New Only"
    },
    "filterBar": {
      "containerClasses": "relative flex-1",
      "parentClasses": "flex items-center gap-3",
      "hasSearchOnOwnRow": false
    },
    "themeToggle": {
      "classes": "flex h-10 w-10 items-center justify-center rounded-lg border border-blue-100 bg-blue-50 p-2.5 text-blue-600 transition-colors hover:bg-blue-100 dark:border-blue-900 dark:bg-blue-950 dark:text-blue-400 dark:hover:bg-blue-900",
      "isRoundedSquare": true,
      "isRoundedFull": false,
      "hasBlue": true
    },
    "headerBrand": {
      "classes": "mx-auto flex max-w-7xl items-center justify-between px-4 py-3 sm:px-6",
      "isStacked": false
    },
    "bodyClasses": "geist_a71539c9-module__T19VSG__variable geist_mono_8d43a2aa-module__8Li5zG__variable antialiased",
    "htmlClasses": "",
    "bodyBg": "rgba(0, 0, 0, 0) linear-gradient(rgb(239, 246, 255), rgb(255, 255, 255), rgb(255, 255, 255)) repeat scroll 0% 0% / auto padding-box border-box",
    "dashboardNegMargin": [
      "-mt-1 hidden text-xs text-brand-primary sm:block",
      "-mt-12 space-y-6"
    ],
    "expandedCard": {
      "boldElementsCount": 3,
      "boldTexts": [
        "Some features require Windows E3 or equivalent licenses",
        "Requires Entra ID P1.",
        "Remediate is currently not available"
      ]
    }
  },
  "matches": [
    "Impact rows: have borders",
    "Bold rendering: <strong> elements found (Some features require Windows E3 or equivalent licenses, Requires Entra ID P1., Remediate is currently not available)",
    "Theme toggle: rounded square with blue tint",
    "Dashboard: has negative top margin overlap",
    "Page background: gradient detected",
    "Filtered card: New Standards section has vertical layout",
    "Hero: has large bottom padding"
  ],
  "issues": [
    "Standard count: local=162, original=159",
    "Impact order mismatch: local=[High Impact21, Low Impact91, Medium Impact47, Set Intune Windows diagnostic data settingsLow ImpactSome features require Windows E3 or equivalent licenses Configures Windows diagnostic data settings for Intune. Enables features like Windows update reports, device readiness reports, and driver update reports. More information can be found in Microsoft's documentation.1/27/2026, Set auto enable archive mailbox stateLow ImpactEnables or disables the tenant policy that automatically provisions an archive mailbox when a user's primary mailbox reaches 90% of its quota.1/16/2026, Configure MDM enrollment when adding work or school accountMedium ImpactControls the \"Allow my organization to manage my device\" prompt when adding a work or school account on Windows. This setting determines whether automatic MDM enrollment occurs during account registration.12/15/2025, Configure Auto-Archiving ThresholdLow ImpactConfigures the auto-archiving threshold percentage for the tenant. When a mailbox exceeds this threshold, the oldest items are automatically moved to the archive mailbox. Archive must be enabled manually or via the CIPP standard 'Enable Online Archive for all users'. More information can be found in Microsoft's documentation.12/11/2025, Update Secure Score Control ProfilesLow ImpactAllows bulk updating of Secure Score control profiles across tenants. Select controls and assign them to different states: Default, Ignored, Third-Party, or Reviewed.11/19/2025, Set Teams chat with anyone settingLow ImpactControls whether users can start Teams chats with any email address, inviting external recipients as guests via email.11/3/2025, Control BitLocker key recovery for owned devicesLow ImpactControls whether standard users can recover BitLocker keys for devices they own.10/12/2025, Assignment Filter TemplateMedium ImpactDeploy and manage assignment filter templates.10/4/2025, Set Teams Chat Protection SettingsLow ImpactConfigures Teams chat protection settings including weaponizable file protection and malicious URL protection.10/2/2025, Windows Hello for Business enrollment configurationLow ImpactSets the Windows Hello for Business configuration during device enrollment.9/25/2025, Deploy Check Chrome ExtensionLow ImpactDeploys the Check Chrome extension via Intune OMA-URI custom policies for both Chrome and Edge browsers with configurable settings. Chrome ID: benimdeioplgkhanklclahllklceahbe, Edge ID: knepjpocdagponkonnbggpcnhnaikajg9/18/2025, Remove legacy Outlook Report add-insLow ImpactRemoves legacy Report Phishing and Report Message Outlook add-ins.8/26/2025, Restrict Email Attachments on Unmanaged DevicesMedium ImpactRestricts how users on unmanaged devices can interact with email attachments in Outlook on the web and new Outlook for Windows. Prevents downloading attachments or blocks viewing them entirely.8/22/2025, Set SharePoint and OneDrive File RequestsMedium ImpactEnables or disables File Requests for SharePoint and OneDrive, allowing users to create secure upload-only links. Optionally sets the maximum number of days for the link to remain active before expiring.7/30/2025, Complete Authentication Methods Policy MigrationMedium ImpactCompletes the migration of authentication methods policy to the new format7/7/2025, Set Entra ID Custom Banned Password ListMedium ImpactRequires Entra ID P1. Updates and enables the Entra ID custom banned password list with the supplied words. Enter words separated by commas or semicolons. Each word must be 4-16 characters long. Maximum 1,000 words allowed.6/28/2025, Disable Exchange Online PowerShell for non-admin usersMedium ImpactDisables Exchange Online PowerShell access for non-admin users by setting the RemotePowerShellEnabled property to false for each user. This helps prevent attackers from using PowerShell to run malicious commands, access file systems, registry, and distribute ransomware throughout networks. Users with admin roles are automatically excluded.6/19/2025, Enables DMARC on MOERA (onmicrosoft.com) domainsLow ImpactNote: requires 'Domain Name Administrator' GDAP role. This should be enabled even if the MOERA (onmicrosoft.com) domains is not used for sending. Enabling this prevents email spoofing. The default value is 'v=DMARC1; p=reject;' recommended because the domain is only used within M365 and reporting is not needed. Omitting pct tag default to 100%6/16/2025, Teams Meeting Verification (CAPTCHA)Low ImpactConfigures CAPTCHA verification for external users joining Teams meetings. This helps prevent unauthorized AI notetakers and bots from joining meetings.6/14/2025, Set two-click confirmation for encrypted emails in New OutlookLow ImpactConfigures the two-click confirmation requirement for viewing encrypted/protected emails in OWA and new Outlook. When enabled, users must click \"View message\" before accessing protected content, providing an additional layer of privacy protection.6/13/2025, Set Default Sharing Link SettingsLow ImpactConfigure the SharePoint default sharing link type and permission. This setting controls both the type of sharing link created by default and the permission level assigned to those links.6/13/2025, Restrict access to SharePoint and OneDrive from unmanaged devicesHigh ImpactEntra P1 required. Block or limit access to SharePoint and OneDrive content from unmanaged devices (those not hybrid AD joined or compliant in Intune). These controls rely on Microsoft Entra Conditional Access policies and can take up to 24 hours to take effect.6/13/2025, Restrict third-party storage services in Microsoft 365 on the webMedium ImpactRestricts third-party storage services in Microsoft 365 on the web by managing the Microsoft 365 on the web service principal. This disables integrations with services like Dropbox, Google Drive, Box, and other third-party storage providers.6/6/2025, Enable Name PronunciationLow ImpactEnables the Name Pronunciation feature for the tenant. This allows users to set their name pronunciation in their profile.6/6/2025, Enable internal phishing protection for FormsLow ImpactEnables internal phishing protection for Microsoft Forms to help prevent malicious forms from being created and shared within the organization. This feature scans forms created by internal users for potential phishing content and suspicious patterns.6/6/2025, Allow guest users in TeamsLow ImpactAllow guest users access to teams.6/3/2025, Disable Unlicensed Resource Mailbox Entra accountsMedium ImpactBlocks login for all accounts that are marked as a resource mailbox and does not have a license assigned. Accounts that are synced from on-premises AD are excluded, as account state is managed in the on-premises AD.6/1/2025, Deploy Mail Contact TemplateLow ImpactCreates new mail contacts in Exchange Online across all selected tenants based on the selected templates. The contact will be visible in the Global Address List unless hidden.5/31/2025, Set Direct Send stateMedium ImpactSets the state of Direct Send in Exchange Online. Direct Send allows applications to send emails directly to Exchange Online mailboxes as the tenants domains, without requiring authentication.5/28/2025, Set Mailbox Recipient LimitsLow ImpactSets the maximum number of recipients that can be specified in the To, Cc, and Bcc fields of a message for all mailboxes in the tenant.5/28/2025, Custom Quarantine PolicyLow ImpactThis standard creates a Custom Quarantine Policies that can be used in Anti-Spam and all MDO365 policies. Quarantine Policies can be used to specify recipients permissions, enable end-user spam notifications, and specify the release action preference5/16/2025, Set Exchange Outbound Spam LimitsLow ImpactConfigures the outbound spam recipient limits (external per hour, internal per hour, per day) and the action to take when a limit is reached. The 'Set Outbound Spam Alert e-mail' standard is recommended to configure together with this one. 5/13/2025, SafeLinks Policy TemplateMedium ImpactDeploy and manage SafeLinks policy templates to protect against malicious URLs in emails and Office documents.4/29/2025, Set Teams Meeting Recording ExpirationMedium ImpactSets the default number of days after which Teams meeting recordings automatically expire. Valid values are -1 (Never Expire) or between 1 and 99999. The default value is 120 days.4/17/2025, SharePoint Mass Deletion AlertLow ImpactSets a e-mail address to alert when a User deletes more than 20 SharePoint files within 60 minutes. NB: Requires a Office 365 E5 subscription, Office 365 E3 with Threat Intelligence or Office 365 EquivioAnalytics add-on.4/7/2025, Device enrollment restrictionsLow ImpactSets the default platform restrictions for enrolling devices into Intune. Note: Do not block personally owned if platform is blocked.4/1/2025, Add allowed domains to Spoof IntelligenceMedium ImpactThis adds allowed domains to the Spoof Intelligence Allow/Block List.3/28/2025, Phishing Simulation ConfigurationMedium ImpactThis creates a phishing simulation policy that enables phishing simulations for the entire tenant.3/27/2025, Preferred language for all usersHigh ImpactSets the preferred language property for all users in the tenant. This will override the user's language settings.2/26/2025, Configure MDM user scopeLow ImpactConfigures the MDM user scope. This also sets the terms of use, discovery and compliance URL to default URLs.2/18/2025, Set Anti-Spam Connection Filter Safe ListMedium ImpactSets the anti-spam connection filter policy option 'safe list' in Defender.2/15/2025, Configure Authentication Methods Policy SettingsLow ImpactConfigures the report suspicious activity settings and system credential preferences in the authentication methods policy.2/10/2025, Automatically deploy proxy addressesMedium ImpactAutomatically adds all available domains as a proxy address.2/7/2025, Retention Policy, permanently delete items in Deleted Items after X daysHigh ImpactCreates a CIPP - Deleted Items retention policy tag that permanently deletes items in the Deleted Items folder after X days.2/2/2025, Allow users to set profile photosLow ImpactControls whether users can set their own profile photos in Microsoft 365.1/19/2025, Cleanup stale Entra devicesHigh ImpactRemediate is currently not available. Cleans up Entra devices that have not connected/signed in for the specified number of days.1/19/2025, Global Messaging Policy for Microsoft TeamsMedium ImpactSets the properties of the Global messaging policy.1/10/2025, Guest Invite settingMedium ImpactThis setting controls who can invite guests to your directory to collaborate on resources secured by your company, such as SharePoint sites or Azure resources.11/12/2024, Set Intune Compliance SettingsLow ImpactSets the mark devices with no compliance policy assigned as compliance/non compliant and Compliance status validity period.11/12/2024, Define Global Meeting Policy for TeamsLow ImpactDefines the CIS recommended global meeting policy for Teams. This includes AllowAnonymousUsersToJoinMeeting, AllowAnonymousUsersToStartMeeting, AutoAdmittedUsers, AllowPSTNUsersToBypassLobby, MeetingChatEnabledType, DesignatedPresenterRoleMode, AllowExternalParticipantGiveRequestControl11/12/2024, Default voice and face enrollmentLow ImpactControls whether users with this policy can set the voice profile capture and enrollment through the Recognition tab in their Teams client settings.11/12/2024, Federation Configuration for Microsoft TeamsMedium ImpactSets the properties of the Global federation configuration.7/31/2024, Disallow emails to be sent to channel email addressesLow ImpactShould users be allowed to send emails directly to a channel email addresses?7/30/2024, External Access Settings for Microsoft TeamsMedium ImpactSets the properties of the Global external access policy.7/30/2024, Define approved cloud storage services for external file sharing in TeamsLow ImpactEnsure external file sharing in Teams is enabled for only approved cloud storage services.7/28/2024, Disable automatic forwarding to external recipientsHigh ImpactDisables the ability for users to automatically forward e-mails to external recipients.7/26/2024, Set SharePoint sync button stateMedium ImpactIf disabled, users in the tenant will no longer be able to use the Sync button to sync SharePoint content on all sites. However, existing synced content will remain functional on the user's computer.7/26/2024, Quarantine Release Request AlertLow ImpactSets a e-mail address to alert when a User requests to release a quarantined message.7/15/2024, Default Spam Filter PolicyMedium ImpactThis standard creates a Spam filter policy similar to the default strict policy.7/15/2024, Disable Legacy WorkflowsLow ImpactDisables the creation of new SharePoint 2010 and 2013 classic workflows and removes the 'Return to classic SharePoint' link on modern SharePoint list and library pages.7/15/2024, Enable SharePoint and OneDrive integration with Azure AD B2BLow ImpactEnsure SharePoint and OneDrive integration with Azure AD B2B is enabled7/9/2024, Disallow downloading infected files from SharePointLow ImpactEnsure Office 365 SharePoint infected files are disallowed for download7/9/2024, Set guest access to expire automaticallyMedium ImpactEnsure guest access to a site or OneDrive will expire automatically7/9/2024, Require re-authentication with verification codeMedium ImpactEnsure re-authentication with verification code is restricted7/9/2024, Deploy ApplicationLow ImpactDeploys selected applications to the tenant. Use a comma separated list of application IDs to deploy multiple applications. Permissions will be copied from the source application.7/7/2024, Set the state of the built-in Report button in OutlookMedium ImpactSet the state of the spam submission button in Outlook6/28/2024, Enable Litigation Hold for all usersLow ImpactEnables litigation hold for all UserMailboxes with a valid license.6/25/2024, Set Intune Company Portal branding profileLow ImpactSets the branding profile for the Intune Company Portal app. This is a tenant wide setting and overrules any settings set on the app level.6/20/2024, Restrict sharing to a specific domainHigh ImpactRestricts sharing to only users with the specified domain. This is useful for organizations that only want to share with their own domain.6/20/2024, Enables per user MFA for all users.High ImpactEnables per user MFA for all users.6/14/2024, Enable PronounsLow ImpactEnables the Pronouns feature for the tenant. This allows users to set their pronouns in their profile.6/5/2024, Set Cloud Message Recall stateLow ImpactSets the Cloud Message Recall state for the tenant. This allows users to recall messages from the cloud.5/31/2024, Set Teams Meetings by default stateLow ImpactSets the default state for automatically turning meetings into Teams meetings for the tenant. This can be overridden by the user in Outlook.5/31/2024, Set Bookings stateMedium ImpactSets the state of Bookings on the tenant. Bookings is a scheduling tool that allows users to book appointments with others both internal and external.5/31/2024, Set shorten meetings stateMedium ImpactSets the shorten meetings settings on a tenant level. This will shorten meetings by the selected amount of minutes. Valid values are 0 to 29. Short meetings are under 60 minutes, long meetings are over 60 minutes.5/27/2024, Set branding for the tenantLow ImpactSets the branding for the tenant. This includes the login page, and the Office 365 portal.5/13/2024, Set Global Quarantine Notification IntervalLow ImpactSets the Global Quarantine Notification Interval to the selected value. Determines how often the quarantine notification is sent to users.5/3/2024, Disable TNEF/winmail.datLow ImpactDisables Transport Neutral Encapsulation Format (TNEF)/winmail.dat for the tenant. TNEF can cause issues if the recipient is not using a client supporting TNEF.4/26/2024, Set Focused Inbox stateLow ImpactSets the default Focused Inbox state for the tenant. This can be overridden by the user.4/26/2024, Set Default Timezone for TenantLow ImpactSets the default timezone for the tenant. This will be used for all new users and sites.4/20/2024, Sets the Cross-tenant access setting to trust external MFALow ImpactSets the state of the Cross-tenant access setting to trust external MFA. This allows guest users to use their home tenant MFA to access your tenant.3/26/2024, Default Safe Links PolicyLow ImpactThis creates a Safe Links policy that automatically scans, tracks, and and enables safe links for Email, Office, and Teams for both external and internal senders3/25/2024, Default Anti-Phishing PolicyLow ImpactThis creates a Anti-Phishing policy that automatically enables Mailbox Intelligence and spoofing, optional switches for Mail tips.3/25/2024, Default Safe Attachment PolicyLow ImpactThis creates a Safe Attachment policy3/25/2024, Default Atp Policy For O365Low ImpactThis creates a Atp policy that enables Defender for Office 365 for SharePoint, OneDrive and Microsoft Teams.3/25/2024, Default Malware Filter PolicyLow ImpactThis creates a Malware filter policy that enables the default File filter and Zero-hour auto purge for malware.3/25/2024, Disable App creation by usersLow ImpactDisables the ability for users to create App registrations in the tenant.3/20/2024, Deploy Mail ContactLow ImpactCreates a new mail contact in Exchange Online across all selected tenants. The contact will be visible in the Global Address List.3/19/2024, Lower Transport Message Expiration to 12 hoursLow ImpactSets the transport message configuration to timeout a message at 12 hours.2/23/2024, Disables QR Code Pin as an MFA methodHigh ImpactThis blocks users from using QR Code Pin as an MFA method. If a user only has QR Code Pin as a MFA method, they will be unable to log in.2/10/2024, Disable users from installing add-ins in OutlookMedium ImpactDisables the ability for users to install add-ins in Outlook. This is to prevent users from installing malicious add-ins.2/5/2024, Disable legacy basic authentication for SharePointMedium ImpactDisables the ability to authenticate with SharePoint using legacy authentication methods. Any applications that use legacy authentication will need to be updated to use modern authentication.2/5/2024, Enable Phishing Protection system via branding CSSLow ImpactAdds branding to the logon page that only appears if the url is not login.microsoftonline.com. This potentially prevents AITM attacks via EvilNginx. This will also automatically generate alerts if a clone of your login page has been found when set to Remediate.1/22/2024, Enable Online Archive for all usersLow ImpactEnables the In-Place Online Archive for all UserMailboxes with a valid license.1/20/2024, Disable additional storage providers in OWALow ImpactDisables the ability for users to open files in Outlook on the Web, from other providers such as Box, Dropbox, Facebook, Google Drive, OneDrive Personal, etc.1/17/2024, Enable all MailTipsLow ImpactEnables all MailTips in Outlook. MailTips are the notifications Outlook and Outlook on the web shows when an email you create, meets some requirements1/14/2024, Enable Customer LockboxLow ImpactEnables Customer Lockbox that offers an approval process for Microsoft support to access organization data1/8/2024, Enable Mailbox auditingLow ImpactEnables Mailbox auditing for all mailboxes and on tenant level. Disables audit bypass on all mailboxes. Unified Audit Log needs to be enabled for this standard to function.1/8/2024, Disable external calendar sharingLow ImpactDisables the ability for users to share their calendar with external users. Only for the default policy, so exclusions can be made if needed.1/8/2024, Enable Autopilot Status PageLow ImpactDeploy the Autopilot Status Page, which shows progress during device setup through Autopilot.12/30/2023, Enable Autopilot ProfileLow ImpactAssign the appropriate Autopilot profile to streamline device deployment.12/30/2023, Intune TemplateHigh ImpactDeploy and manage Intune templates across devices.12/30/2023, Transport Rule TemplateMedium ImpactDeploy transport rules to manage email flow.12/30/2023, Conditional Access TemplateHigh ImpactManage conditional access policies for better security.12/30/2023, Exchange Connector TemplateMedium ImpactDeploy and manage Exchange connectors.12/30/2023, Group TemplateMedium ImpactDeploy and manage group templates.12/30/2023, Enable Hardware OAuth tokensLow ImpactEnables the HardwareOath authenticationMethod for the tenant. This allows you to use hardware tokens for generating 6 digit MFA codes.12/18/2023, Disables SMS as an MFA methodHigh ImpactThis blocks users from using SMS as an MFA method. If a user only has SMS as a MFA method, they will be unable to log in.12/18/2023, Disables Voice call as an MFA methodHigh ImpactThis blocks users from using Voice call as an MFA method. If a user only has Voice as a MFA method, they will be unable to log in.12/18/2023, Disables Email as an MFA methodHigh ImpactThis blocks users from using email as an MFA method. This disables the email OTP option for guest users, and instead prompts them to create a Microsoft account.12/18/2023, Disables Certificates as an MFA methodHigh ImpactThis blocks users from using Certificates as an MFA method.12/18/2023, Enable OTP via AuthenticatorLow ImpactAllows you to use MS authenticator OTP token generator12/6/2023, Enable App consent admin requestsLow ImpactEnables App consent admin requests for the tenant via the GA role. Does not overwrite existing reviewer settings11/27/2023, Set send/receive size limitsLow ImpactSets the Send and Receive limits for new users. Valid values are 1MB to 150MB11/16/2023, Remove Safe Senders to prevent SPF bypassMedium ImpactLoops through all users and removes the Safe Senders list. This is to prevent SPF bypass attacks, as the Safe Senders list is not checked by SPF.10/26/2023, Require Multi-factor Authentication to register or join devices with Microsoft EntraMedium ImpactRequires MFA for all users to register devices with Intune. This is useful when not using Conditional Access.10/23/2023, Set Add Shortcuts To OneDrive button stateMedium ImpactIf disabled, the button Add shortcut to OneDrive will be removed and users in the tenant will no longer be able to add new shortcuts to their OneDrive. Existing shortcuts will remain functional7/25/2023, Set inactive device retirement daysLow ImpactA value between 31 and 365 is supported. retired devices are removed from Intune after the specified number of days.5/19/2023, Set Authenticator Lite stateLow ImpactSets the state of Authenticator Lite, Authenticator lite is a companion app for passwordless authentication.5/18/2023, Set Outbound Spam Alert e-mailLow ImpactSet the Outbound Spam Alert e-mail address5/3/2023, Set Sharing Level for Default calendarLow ImpactSets the default sharing level for the default calendar, for all users4/27/2023, Enable LAPS on the tenantLow ImpactEnables the tenant to use LAPS. You must still create a policy for LAPS to be active on all devices. Use the template standards to deploy this by default.4/25/2023, Set Maximum Number of Devices per userMedium ImpactSets the maximum number of devices that can be registered by a user. A value of 0 disables device registration by users3/27/2023, Rotate DKIM keys that are 1024 bit to 2048 bitLow ImpactRotate DKIM keys that are 1024 bit to 2048 bit3/14/2023, Enables DKIM for all domains that currently support itLow ImpactEnables DKIM for all domains that currently support it3/14/2023, Enable OTP Software OAuth tokensLow ImpactAllows you to use any software OAuth token generator12/18/2022, Enable FIDO2 capabilitiesLow ImpactEnables the FIDO2 authenticationMethod for the tenant12/8/2022, Sets the state for the request to setup AuthenticatorLow ImpactSets the state of the registration campaign for the tenant12/8/2022, Disable M365 Tenant creation by usersLow ImpactRestricts creation of M365 tenants to the Global Administrator or Tenant Creator roles.11/29/2022, Disable Guest accounts that have not logged on for a number of daysMedium ImpactBlocks login for guest users that have not logged in for a number of days10/20/2022, Allow users to consent to applications with low security risk (Prevent OAuth phishing. Lower impact, less secure)Medium ImpactSets the default oauth consent level so users can consent to applications that have low risks.8/16/2022, Disable M365 Group creation by usersLow ImpactRestricts M365 group creation to certain admin roles. This disables the ability to create Teams, SharePoint sites, Planner, etc7/17/2022, Disable Security Group creation by usersMedium ImpactCompletely disables the creation of security groups by users. This also breaks the ability to manage groups themselves, or create Teams7/17/2022, Set deleted user retention time in OneDriveLow ImpactSets the retention period for deleted users OneDrive to the specified period of time. The default is 30 days.6/15/2022, Set Sharing Level for OneDrive and SharePointHigh ImpactSets the default sharing level for OneDrive and SharePoint. This is a tenant wide setting and overrules any settings set on the site level6/15/2022, Disable Re-sharing by External UsersHigh ImpactDisables the ability for external users to share files they don't own. Sharing links can only be made for People with existing access6/15/2022, Disable site creation by standard usersHigh ImpactDisables users from creating new SharePoint sites6/15/2022, Exclude File Extensions from SyncingHigh ImpactSets the file extensions that are excluded from syncing with OneDrive. These files will be blocked from upload. '*.' is automatically added to the extension and can be omitted.6/15/2022, Do not allow Mac devices to sync using OneDriveHigh ImpactDisables the ability for Mac devices to sync with OneDrive.6/15/2022, Disable daily Insight/Viva reportsLow ImpactDisables the daily viva reports for all users. This standard requires the CIPP-SAM application to have the Company Administrator (Global Admin) role in the tenant. Enable this using CIPP > Advanced > Super Admin > SAM App Roles. Activate the roles with a CPV refresh.5/25/2022, Allow users to send from their alias addressesMedium ImpactEnables the ability for users to send from their alias addresses.5/25/2022, Restrict guest user access to directory objectsLow ImpactDisables Guest access to enumerate directory objects. This prevents guest users from seeing other users or guests in the directory.5/4/2022, Enable Activity based TimeoutMedium ImpactEnables and sets Idle session timeout for Microsoft 365 to 1 hour. This policy affects most M365 web apps4/13/2022, Enable Temporary Access PasswordsLow ImpactEnables TAP and sets the default TAP lifetime to 1 hour. This configuration also allows you to select if a TAP is single use or multi-logon.3/15/2022, Set contact e-mailsLow ImpactDefines the email address to receive general updates and information related to M365 subscriptions. Leave a contact field blank if you do not want to update the contact information.3/13/2022, Undo App Consent StandardHigh ImpactDisables App consent and set to Allow user consent for apps1/7/2022, Enable Security DefaultsHigh ImpactEnables security defaults for the tenant, for newer tenants this is enabled by default. Do not enable this feature if you use Conditional Access.11/19/2021, Enable the Unified Audit LogLow ImpactEnables the Unified Audit Log for tracking and auditing activities. Also runs Enable-OrganizationCustomization if necessary.11/16/2021, Enable Usernames instead of pseudo anonymised names in reportsLow ImpactShows usernames instead of pseudo anonymised names in reports. This standard is required for reporting to work correctly.11/16/2021, Disable SMTP Basic AuthenticationMedium ImpactDisables SMTP AUTH organization-wide, impacting POP and IMAP clients that rely on SMTP for sending emails. Default for new tenants. For more information, see the Microsoft documentation11/16/2021, Enable Passwordless with Location information and Number MatchingLow ImpactEnables the MS authenticator app to display information about the app that is requesting authentication. This displays the application name.11/16/2021, Do not expire passwordsLow ImpactDisables the expiration of passwords for the tenant by setting the password expiration policy to never expire for any user.11/16/2021, Remove Legacy MFA if SD or CA is activeMedium ImpactThis standard currently does not function and can be safely disabled11/16/2021, Disable Self Service LicensingMedium ImpactNote: requires 'Billing Administrator' GDAP role. This standard disables all self service licenses and enables all exclusions11/16/2021, Require admin consent for applications (Prevent OAuth phishing)Medium ImpactDisables users from being able to consent to applications, except for those specified in the field below11/16/2021, Enable Auto-expanding archivesLow ImpactEnables auto-expanding archives for the tenant11/16/2021, Enable or disable 'external' warning in OutlookLow ImpactAdds or removes indicators to e-mail messages received from external senders in Outlook. Works on all Outlook clients/OWA11/16/2021, Set mailbox Sent Items delegation (Sent items for shared mailboxes)Medium ImpactSets emails sent as and on behalf of shared mailboxes to also be stored in the shared mailbox sent items folder11/16/2021, Disable Shared Mailbox Entra accountsMedium ImpactBlocks login for all accounts that are marked as a shared mailbox. This is Microsoft best practice to prevent direct logons to shared mailboxes.11/16/2021], original=[High Impact21, Low Impact90, Medium Impact48]",
    "Category card: not using grid layout (classes: mb-1 flex items-center gap-2)",
    "Filter bar: may not be two-row layout (classes: flex items-center gap-3)",
    "Header brand: not stacked (classes: mx-auto flex max-w-7xl items-center justify-between px-4 py-3 sm:px-6)"
  ],
  "timestamp": "2026-02-17T17:23:40.577Z"
}